Repository: adslbarxatov/OneHundredOne
Catalog: src/OneHundredOne_*.resx
Languages: ru_ru

# HelpText
source: “One hundred and one” game A pack of 36 cards is used. Each player is dealt 4 cards. The last card dealt is placed on the table next to the remaining pack (i.e. the dealer makes the first turn). The next player covers this card with one or more of the cards he has, depending on the situation (see below). If there are no options, player can take one additional card from the pack. If there are still no options, the player skips the turn. Each next player does the same. If the cards in hand run out, the player is out of the round. The round ends when there is only one person left at the table who has cards in his hand. For a game of two, the exit of one player coincides with the end of the round. The player’s penalty points are counted on the remaining cards. Also, according to the cards with which the other players completed the round, their bonuses are determined. As a result, if someone’s points exceed 101, he is considered a loser. If a player gets exactly 101 points, his penalty is reset to zero. There are three ways to cover any card: — a card of the same suit; — a card of the same denomination; — any Queen. In the case of the Queen, the player is required to “order” the suit that will be most convenient for him to continue the game. The opponent will have to cover the Queen with a card of the ordered suit or another Queen. Some cards oblige the opponent to skip a turn and/or draw additional cards from the pack. This allows the player to build sometimes quite long chains and quickly get rid of cards. These cards include: - all Aces (the opponent skips one turn); - all Sevens (the opponent skips one turn and takes 1 card); - all Sixes (the opponent skips one turn and takes 2 cards); - King of Spades (opponent skips one turn and takes 5 cards); - all Eights (the opponent skips the turn, but the player must cover the Eight using his cards or drawing cards from the pack, even if his own have already run out). The rest of the cards after use require only the transition of the turn. Penalty points are calculated as follows: — each Six, Seven, Eight and Ten add their denomination to the sum; — Jack adds 2 points, Queen – 3, King – 4, Ace – 11; — Nines don’t affect the score. Bonuses are calculated as follows: — if a player exits the round by covering the card with the Queen of Spades, 40 points are deducted from his penalty; — if the player goes out with any other Queen, 20 points are deducted. For this reason, players’ scores can be negative
ru_ru: Игра «сто одно» Используется колода в 36 карт. Каждому игроку сдаётся по 4 карты. Последняя выдаваемая карта кладётся на стол рядом с оставшейся колодой (т.е. раздающий выполняет первый ход). Следующий игрок покрывает эту карту одной или несколькими из имеющихся у него карт, в зависимости от ситуации (см. ниже). Если вариантов нет, можно взять одну дополнительную карту из колоды. Если вариантов всё равно нет, игрок пропускает ход. Каждый следующий игрок делает то же самое. Если карты на руках заканчиваются, игрок выходит из раунда. Раунд заканчивается тогда, когда остаётся лишь один человек за столом, который имеет карты на руках. Для парной игры выход одного игрока совпадает с завершением раунда. По оставшимся картам считаются штрафные очки игрока. Также по тем картам, которыми остальные игроки завершили раунд, определяются их бонусы. В итоге, если чьи-то очки превышают 101, он считается проигравшим. Если игрок получает ровно 101 очко, его штраф обнуляется. Покрыть любую карту можно тремя способами: — картой той же масти; — картой того же номинала; — любой дамой. В случае с дамой от игрока требуется «заказать» масть, которая будет ему наиболее удобна для продолжения игры. Противник должен будет покрыть даму картой заказанной масти или другой дамой. Некоторые карты обязывают противника пропускать ход и/или брать дополнительные карты из колоды. Это позволяет игроку выстраивать порой достаточно длинные цепочки и быстро избавляться от карт. К таким картам относятся: — все тузы (противник должен пропустить ход); — все семёрки (противник должен пропустить ход и взять 1 карту); — все шестёрки (противник должен пропустить ход и взять 2 карты); — король пик (противник должен пропустить ход и взять 5 карт); — все восьмёрки (противник должен пропустить ход, однако игрок обязан покрыть восьмёрку, используя свои карты или добирая карты из колоды, даже если свои уже кончились). Остальные карты после использования требуют только перехода хода. Штрафные очки считаются следующим образом: — каждая шестёрка, семёрка, восьмёрка и десятка добавляют к сумме свой номинал; — валет добавляет 2 очка, дама – 3, король – 4, туз – 11; — девятки не влияют на счёт. Бонусы считаются следующим образом: — если игрок выходит из раунда, покрывая карту пиковой дамой, от его штрафа отнимается 40 очков; — если игрок выходит с любой другой дамой, отнимается 20 очков. По этой причине очки игроков могут быть отрицательными

# CardIsNotSuitable
source: The selected card is not suitable for the turn
ru_ru: Выбранная карта не подходит для выполнения хода

# CardNotSelected
source: No card selected for turn
ru_ru: Не выбрана карта для выполнения хода

# CardValue_Ace
source: A
ru_ru: Т

# CardValue_Jack
source: J
ru_ru: В

# CardValue_King
source: K
ru_ru: К

# CardValue_Queen
source: Q
ru_ru: Д

# EightShouldBeCovered
source: The eight needs to be covered
ru_ru: Восьмёрку обязательно нужно покрыть

# FinishGame
source: Finish the game?
ru_ru: Завершить игру?

# LoseMessage
source: This game is lost
ru_ru: Эта игра проиграна

# LoseRoundMessage
source: You have lost this round
ru_ru: Вы проиграли в этом раунде

# OrderSuit
source: Order a suit
ru_ru: Закажите масть

# PCScore
source: Computer:
ru_ru: Компьютер:

# PlayerScore
source: Player:
ru_ru: Игрок:

# WinMessage
source: YOU WON THIS GAME!!!
ru_ru: ВЫ ПОБЕДИЛИ В ЭТОЙ ИГРЕ!!!

# WinRoundMessage
source: You have won this round!
ru_ru: Вы победили в этом раунде!

source: &Begin the game
ru_ru: &Начать игру

# GetHelp
source: &Help
ru_ru: &Справка

source: &Skip turn
ru_ru: &Пропустить ход

source: &Take card
ru_ru: &Взять карту
